# ParamId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellCombinedParameterData..::..ParamId Property
TableCellCombinedParameterData Class See Also
---
The parameter id
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId ParamId { get; set; }
```

Visual Basic
---
```text
Public Property ParamId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ParamId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace